In [145]:
import sqlite3
import pandas as pd
from sqlalchemy import create_engine

books = pd.read_csv('books.csv')
books = books.drop('Unnamed: 0',axis=1)

books.columns = ['title','price','star_rating','category','status_stock','number_stock']

consulta_books = """

    CREATE TABLE books(
    title TEXT,
    price REAL,
    star_rating INTEGER,
    category TEXT,
    status_stock TEXT,
    number_stock INTEGER
    )"""


## Conex√£o com o BD
conn = sqlite3.connect('books.sqlite')
cursor = conn.execute(consulta_books)
conn.commit()

In [147]:
conn = create_engine('sqlite:///books.sqlite',echo=False)

In [152]:
consulta = """
    select * from books"""

df = pd.read_sql_query(consulta,conn)
df.head()

,title,price,star_rating,category,status_stock,number_stock
0,The Secret Garden,15.08,4,Classics,Instock,5
1,The Metamorphosis,28.58,ruim demais,Classics,Instock,5
2,The Pilgrim's Progress,50.26,2,Classics,Instock,4
3,The Hound of the Baskervilles (Sherlock Holmes...,14.82,2,Classics,Instock,4
4,Little Women (Little Women #1),28.07,4,Classics,Instock,4

In [149]:
# Inser Table do DB
books.to_sql('books',con=conn,if_exists='append',index=False)

In [151]:
## Comandos
consulta = """
    update books
    set star_rating = 'ruim demais'
    where star_rating = 1
    """
conn = sqlite3.connect('books.sqlite')
cursor = conn.execute(consulta)
conn.commit()